{
  "lexicon_size": 4380,
  "unk_index": 2067,
  "vector_size": 4381,
  "min_token_freq": 2,
  "token_to_index": {
    "android.intent.action.MAIN": 0,
    "android.intent.category.LAUNCHER": 1,
    "android.permission.INTERNET": 2,
    "android.permission.ACCESS_NETWORK_STATE": 3,
    "android.permission.WRITE_EXTERNAL_STORAGE": 4,
    "android.permission.ACCESS_WIFI_STATE": 5,
    "android.permission.READ_EXTERNAL_STORAGE": 6,
    "android.permission.WAKE_LOCK": 7,
    "android.intent.action.BOOT_COMPLETED": 8,
    "android.intent.category.DEFAULT": 9,
    "android.permission.VIBRATE": 10,
    "android.permission.READ_PHONE_STATE": 11,
    "android.permission.RECEIVE_BOOT_COMPLETED": 12,
    "android.intent.category.BROWSABLE": 13,
    "android.permission.ACCESS_FINE_LOCATION": 14,
    "android.intent.action.VIEW": 15,
    "android.permission.ACCESS_COARSE_LOCATION": 16,
    "android.permission.FOREGROUND_SERVICE": 17,
    "android.permission.CHANGE_WIFI_STATE": 18,
    "android.intent.action.USER_PRESENT": 19,
    "com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE": 20,
    "android.permission.SYSTEM_ALERT_WINDOW": 21,
    "android.permission.CAMERA": 22,
    "android.net.conn.CONNECTIVITY_CHANGE": 23,
    "com.android.vending.INSTALL_REFERRER": 24,
    "com.google.android.c2dm.permission.RECEIVE": 25,
    "android.permission.REQUEST_INSTALL_PACKAGES": 26,
    "android.permission.GET_TASKS": 27,
    "com.google.android.c2dm.intent.RECEIVE": 28,
    "android.permission.CALL_PHONE": 29,
    "android.intent.action.PACKAGE_ADDED": 30,
    "android.permission.READ_CONTACTS": 31,
    "android.permission.RECORD_AUDIO": 32,
    "android.permission.BLUETOOTH": 33,
    "android.permission.CHANGE_NETWORK_STATE": 34,
    "android.intent.action.PACKAGE_REMOVED": 35,
    "android.intent.action.QUICKBOOT_POWERON": 36,
    "android.intent.action.SEND": 37,
    "android.permission.RECEIVE_SMS": 38,
    "android.permission.READ_SMS": 39,
    "android.intent.action.ACTION_POWER_CONNECTED": 40,
    "android.permission.SEND_SMS": 41,
    "android.permission.MODIFY_AUDIO_SETTINGS": 42,
    "android.permission.RECEIVE_USER_PRESENT": 43,
    "android.permission.WRITE_SETTINGS": 44,
    "android.permission.MOUNT_UNMOUNT_FILESYSTEMS": 45,
    "com.google.firebase.MESSAGING_EVENT": 46,
    "android.intent.action.ACTION_POWER_DISCONNECTED": 47,
    "android.intent.action.RESPOND_VIA_MESSAGE": 48,
    "android.intent.action.SENDTO": 49,
    "android.provider.Telephony.SMS_DELIVER": 50,
    "android.provider.Telephony.WAP_PUSH_DELIVER": 51,
    "android.permission.GET_ACCOUNTS": 52,
    "android.permission.DISABLE_KEYGUARD": 53,
    "android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS": 54,
    "com.google.firebase.INSTANCE_ID_EVENT": 55,
    "android.accessibilityservice.AccessibilityService": 56,
    "com.huawei.android.launcher.permission.CHANGE_BADGE": 57,
    "com.htc.intent.action.QUICKBOOT_POWERON": 58,
    "android.permission.WRITE_SMS": 59,
    "android.intent.action.TIME_SET": 60,
    "android.permission.BLUETOOTH_ADMIN": 61,
    "android.intent.action.TIMEZONE_CHANGED": 62,
    "com.htc.launcher.permission.READ_SETTINGS": 63,
    "android.provider.Telephony.SMS_RECEIVED": 64,
    "com.huawei.android.launcher.permission.READ_SETTINGS": 65,
    "com.android.vending.BILLING": 66,
    "com.sec.android.provider.badge.permission.WRITE": 67,
    "com.sec.android.provider.badge.permission.READ": 68,
    "com.huawei.android.launcher.permission.WRITE_SETTINGS": 69,
    "com.sonyericsson.home.permission.BROADCAST_BADGE": 70,
    "com.htc.launcher.permission.UPDATE_SHORTCUT": 71,
    "android.permission.REQUEST_DELETE_PACKAGES": 72,
    "com.sonymobile.home.permission.PROVIDER_INSERT_BADGE": 73,
    "com.oppo.launcher.permission.READ_SETTINGS": 74,
    "com.anddoes.launcher.permission.UPDATE_COUNT": 75,
    "com.majeur.launcher.permission.UPDATE_BADGE": 76,
    "android.permission.ACCESS_LOCATION_EXTRA_COMMANDS": 77,
    "android.permission.FLASHLIGHT": 78,
    "android.permission.READ_LOGS": 79,
    "android.intent.action.BATTERY_OKAY": 80,
    "android.intent.action.BATTERY_LOW": 81,
    "com.oppo.launcher.permission.WRITE_SETTINGS": 82,
    "com.android.launcher.permission.INSTALL_SHORTCUT": 83,
    "android.permission.READ_APP_BADGE": 84,
    "android.intent.action.MY_PACKAGE_REPLACED": 85,
    "me.everything.badger.permission.BADGE_COUNT_READ": 86,
    "me.everything.badger.permission.BADGE_COUNT_WRITE": 87,
    "android.app.action.DEVICE_ADMIN_ENABLED": 88,
    "android.intent.action.DEVICE_STORAGE_LOW": 89,
    "android.intent.action.DEVICE_STORAGE_OK": 90,
    "androidx.work.impl.background.systemalarm.UpdateProxies": 91,
    "android.intent.action.SCREEN_ON": 92,
    "android.permission.SYSTEM_OVERLAY_WINDOW": 93,
    "android.net.wifi.WIFI_STATE_CHANGED": 94,
    "android.permission.KILL_BACKGROUND_PROCESSES": 95,
    "android.service.notification.NotificationListenerService": 96,
    "android.permission.SET_WALLPAPER": 97,
    "android.intent.action.EXTERNAL_APPLICATIONS_AVAILABLE": 98,
    "android.intent.category.HOME": 99,
    "com.sina.weibo.sdk.action.ACTION_SDK_REQ_ACTIVITY": 100,
    "android.permission.REORDER_TASKS": 101,
    "com.ss.android.socialbase.downloader.remote": 102,
    "android.app.action.DEVICE_ADMIN_DISABLED": 103,
    "android.permission.PACKAGE_USAGE_STATS": 104,
    "com.android.launcher.permission.READ_SETTINGS": 105,
    "com.xiaomi.mipush.ERROR": 106,
    "com.xiaomi.mipush.RECEIVE_MESSAGE": 107,
    "android.app.action.ACTION_DEVICE_ADMIN_DISABLE_REQUESTED": 108,
    "android.app.role.SMS": 109,
    "android.permission.DOWNLOAD_WITHOUT_NOTIFICATION": 110,
    "android.permission.EXPAND_STATUS_BAR": 111,
    "android.permission.CHANGE_CONFIGURATION": 112,
    "com.xiaomi.mipush.MESSAGE_ARRIVED": 113,
    "cn.jpush.android.intent.NOTIFICATION_RECEIVED_PROXY": 114,
    "cn.jpush.android.ui.PushActivity": 115,
    "android.permission.RESTART_PACKAGES": 116,
    "com.huawei.android.push.intent.RECEIVE": 117,
    "com.huawei.android.push.intent.REGISTRATION": 118,
    "android.intent.action.DREAMING_STOPPED": 119,
    "cn.jpush.android.intent.PUSH_TIME": 120,
    "cn.jpush.android.intent.PushService": 121,
    "cn.jpush.android.intent.REGISTER": 122,
    "cn.jpush.android.intent.REPORT": 123,
    "com.xiaomi.push.PING_TIMER": 124,
    "com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY": 125,
    "android.permission.QUICKBOOT_POWERON": 126,
    "android.appwidget.action.APPWIDGET_UPDATE": 127,
    "android.permission.QUERY_ALL_PACKAGES": 128,
    "android.intent.action.PACKAGE_REPLACED": 129,
    "android.permission.READ_PROFILE": 130,
    "cn.jpush.android.intent.DaemonService": 131,
    "android.permission.BROADCAST_STICKY": 132,
    "com.google.android.c2dm.intent.REGISTRATION": 133,
    "android.permission.ACCESS_NOTIFICATION_POLICY": 134,
    "cn.jpush.android.intent.NOTIFICATION_OPENED": 135,
    "cn.jpush.android.intent.MESSAGE_RECEIVED": 136,
    "cn.jpush.android.intent.REGISTRATION": 137,
    "cn.jpush.android.intent.NOTIFICATION_RECEIVED": 138,
    "android.intent.action.SCREEN_OFF": 139,
    "android.permission.MANAGE_ACCOUNTS": 140,
    "android.permission.USE_FINGERPRINT": 141,
    "com.coloros.mcs.permission.RECIEVE_MCS_MESSAGE": 142,
    "cn.jpush.android.intent.CONNECTION": 143,
    "com.facebook.sdk.ACTION_CURRENT_ACCESS_TOKEN_CHANGED": 144,
    "android.permission.USE_FULL_SCREEN_INTENT": 145,
    "android.permission.RECEIVE_MMS": 146,
    "com.asus.msa.SupplementaryDID.ACCESS": 147,
    "android.permission.CHANGE_WIFI_MULTICAST_STATE": 148,
    "com.coloros.mcs.action.RECEIVE_MCS_MESSAGE": 149,
    "android.permission.USE_CREDENTIALS": 150,
    "android.permission.WRITE_CONTACTS": 151,
    "com.yandex.metrica.IMetricaService": 152,
    "com.huawei.push.action.MESSAGING_EVENT": 153,
    "cn.jpush.android.intent.RECEIVE_MESSAGE": 154,
    "android.intent.action.ACTION_BOOT_COMPLETED": 155,
    "android.permission.ACCESS_BACKGROUND_LOCATION": 156,
    "android.intent.action.MEDIA_MOUNTED": 157,
    "com.vivo.pushclient.action.RECEIVE": 158,
    "android.intent.action.DATE_CHANGED": 159,
    "com.huawei.intent.action.PUSH_STATE": 160,
    "org.agoo.android.intent.action.RECEIVE": 161,
    "android.permission.ACCESS_MOCK_LOCATION": 162,
    "com.huawei.intent.action.PUSH": 163,
    "cn.jpush.android.intent.JNotifyActivity": 164,
    "com.taobao.accs.intent.action.COMMAND": 165,
    "com.taobao.accs.intent.action.RECEIVE": 166,
    "com.taobao.accs.intent.action.SERVICE": 167,
    "com.yandex.metrica.configuration.ACTION_INIT": 168,
    "com.google.android.providers.gsf.permission.READ_GSERVICES": 169,
    "android.permission.BROADCAST_PACKAGE_REPLACED": 170,
    "android.permission.BROADCAST_PACKAGE_CHANGED": 171,
    "android.permission.SET_WALLPAPER_HINTS": 172,
    "cn.jiguang.user.service.action": 173,
    "org.android.agoo.client.MessageReceiverService": 174,
    "com.meizu.flyme.push.intent.MESSAGE": 175,
    "com.meizu.flyme.push.intent.REGISTER.FEEDBACK": 176,
    "com.meizu.flyme.push.intent.UNREGISTER.FEEDBACK": 177,
    "com.taobao.accs.intent.action.START_FROM_AGOO": 178,
    "com.meizu.c2dm.intent.RECEIVE": 179,
    "com.meizu.c2dm.intent.REGISTRATION": 180,
    "android.intent.action.DOWNLOAD_COMPLETE": 181,
    "com.huawei.android.push.intent.CLICK": 182,
    "android.permission.BROADCAST_PACKAGE_ADDED": 183,
    "android.permission.NFC": 184,
    "android.permission.BROADCAST_PACKAGE_INSTALL": 185,
    "com.meizu.c2dm.permission.RECEIVE": 186,
    "panda.keyboard.emoji.theme.alive.reporter": 187,
    "android.service.wallpaper.WallpaperService": 188,
    "com.android.launcher.permission.UNINSTALL_SHORTCUT": 189,
    "android.permission.TRANSMIT_IR": 190,
    "android.intent.action.SEARCH": 191,
    "com.umeng.message.message.handler.action": 192,
    "com.umeng.messge.registercallback.action": 193,
    "com.huawei.intent.action.PUSH_DELAY_NOTIFY": 194,
    "com.taobao.accs.intent.action.ELECTION": 195,
    "com.umeng.message.disablecallback.action": 196,
    "com.umeng.message.enablecallback.action": 197,
    "android.permission.MODIFY_PHONE_STATE": 198,
    "com.meizu.flyme.push.permission.RECEIVE": 199,
    "android.permission.ACCESS_DOWNLOAD_MANAGER": 200,
    "com.umeng.message.message.sendmessage.action": 201,
    "com.huawei.push.msg.NOTIFY_MSG": 202,
    "com.huawei.push.msg.PASSBY_MSG": 203,
    "android.permission.READ_SETTINGS": 204,
    "com.android.alarm.permission.SET_ALARM": 205,
    "com.heytap.mcs.permission.RECIEVE_MCS_MESSAGE": 206,
    "com.heytap.mcs.action.RECEIVE_MCS_MESSAGE": 207,
    "android.intent.action.REBOOT": 208,
    "android.permission.GET_PACKAGE_SIZE": 209,
    "android.intent.action.BATTERY_CHANGED": 210,
    "com.android.browser.permission.READ_HISTORY_BOOKMARKS": 211,
    "com.sina.weibo.sdk.action.ACTION_SDK_REQ_STORY": 212,
    "android.permission.CAPTURE_VIDEO_OUTPUT": 213,
    "android.intent.action.MEDIA_BUTTON": 214,
    "com.meizu.cloud.pushservice.action.PUSH_SERVICE_START": 215,
    "android.net.VpnService": 216,
    "android.permission.INSTALL_PACKAGES": 217,
    "android.permission.WRITE_SYNC_SETTINGS": 218,
    "android.permission.BATTERY_STATS": 219,
    "android.permission.READ_CALENDAR": 220,
    "com.tencent.mm.plugin.openapi.Intent.ACTION_REFRESH_WXAPP": 221,
    "android.bluetooth.adapter.action.STATE_CHANGED": 222,
    "com.huawei.appmarket.service.commondata.permission.GET_COMMON_DATA": 223,
    "android.intent.action.PHONE_STATE": 224,
    "android.permission.INTERACT_ACROSS_USERS_FULL": 225,
    "android.permission.READ_SYNC_SETTINGS": 226,
    "android.net.wifi.STATE_CHANGE": 227,
    "android.permission.READ_PHONE_NUMBERS": 228,
    "android.intent.action.DOWNLOAD_NOTIFICATION_CLICKED": 229,
    "android.permission.PROCESS_OUTGOING_CALLS": 230,
    "android.permission.WRITE_CALENDAR": 231,
    "android.permission.READ_CALL_LOG": 232,
    "android.permission.AUTHENTICATE_ACCOUNTS": 233,
    "android.permission.ACTION_MANAGE_OVERLAY_PERMISSION": 234,
    "com.android.launcher.permission.WRITE_SETTINGS": 235,
    "com.google.android.gms.gcm.ACTION_TASK_READY": 236,
    "android.hardware.camera.autofocus": 237,
    "android.intent.action.MEDIA_UNMOUNTED": 238,
    "android.permission.ACCESS_CHECKIN_PROPERTIES": 239,
    "android.permission.RECORD_VIDEO": 240,
    "com.android.vending.CHECK_LICENSE": 241,
    "android.permission.ACCESS_GPS": 242,
    "android.permission.RECEIVE_LAUNCH_BROADCASTS": 243,
    "cn.RestartedViaAlarm": 244,
    "android.support.customtabs.action.CustomTabsService": 245,
    "com.mob.intent.MOB_GUARD_SERVICE": 246,
    "android.appwidget.action.APPWIDGET_CONFIGURE": 247,
    "android.intent.action.CREATE_SHORTCUT": 248,
    "com.android.launcher3.permission.READ_SETTINGS": 249,
    "ANDROID.PERMISSION.ACCESS_COARSE_LOCATION": 250,
    "ANDROID.PERMISSION.ACCESS_FINE_LOCATION": 251,
    "android.intent.action.NEW_OUTGOING_CALL": 252,
    "com.heytap.msp.push.RECEIVE_MCS_MESSAGE": 253,
    "com.android.launcher2.permission.READ_SETTINGS": 254,
    "com.google.android.gms.measurement.UPLOAD": 255,
    "android.intent.action.MEDIA_EJECT": 256,
    "android.permission.ACCESS_COARSE_UPDATES": 257,
    "android.intent.action.PACKAGE_CHANGED": 258,
    "cn.jpush.android.ui.PopWinActivity": 259,
    "com.android.browser.permission.WRITE_HISTORY_BOOKMARKS": 260,
    "com.igexin.sdk.action.service.message": 261,
    "android.media.AUDIO_BECOMING_NOISY": 262,
    "android.permission.MODE_WORLD_READABLE": 263,
    "cn.jpush.android.intent.DActivity": 264,
    "android.permission.SET_DEBUG_APP": 265,
    "android.permission.USE_BIOMETRIC": 266,
    "android.intent.action.MEDIA_REMOVED": 267,
    "androidx.work.diagnostics.REQUEST_DIAGNOSTICS": 268,
    "android.intent.action.ACTION_SHUTDOWN": 269,
    "android.permission.CLEAR_APP_CACHE": 270,
    "com.tencent.smtt.tbs.video.PLAY": 271,
    "android.intent.action.WEB_SEARCH": 272,
    "android.intent.action.EDIT": 273,
    "org.simalliance.openmobileapi.SMARTCARD": 274,
    "android.permission.WRITE_CALL_LOG": 275,
    "android.intent.category.LEANBACK_LAUNCHER": 276,
    "android.permission.READ_SYNC_STATS": 277,
    "android.service.quicksettings.action.QS_TILE": 278,
    "com.onesignal.NotificationExtender": 279,
    "android.intent.action.MEDIA_CHECKING": 280,
    "android.permission.WRITE_MEDIA_STORAGE": 281,
    "com.igexin.sdk.action.refreshls": 282,
    "com.mob.open.app": 283,
    "android.permission.INSTALL_SHORTCUT": 284,
    "com.bbk.launcher2.permission.READ_SETTINGS": 285,
    "com.vivo.notification.permission.BADGE_ICON": 286,
    "android.intent.action.LOCKED_BOOT_COMPLETED": 287,
    "android.intent.category.APP_BROWSER": 288,
    "com.fede.launcher.permission.READ_SETTINGS": 289,
    "com.google.android.exoplayer.downloadService.action.RESTART": 290,
    "com.huawei.launcher2.permission.READ_SETTINGS": 291,
    "com.lge.launcher.permission.READ_SETTINGS": 292,
    "com.qihoo360.launcher.permission.READ_SETTINGS": 293,
    "org.adw.launcher.permission.READ_SETTINGS": 294,
    "android.intent.action.HEADSET_PLUG": 295,
    "android.permission.ACCESS_LOCATION": 296,
    "com.huawei.launcher3.permission.READ_SETTINGS": 297,
    "com.tencent.qqlauncher.permission.READ_SETTINGS": 298,
    "net.qihoo.launcher.permission.READ_SETTINGS": 299,
    "org.adwfreak.launcher.permission.READ_SETTINGS": 300,
    "android.intent.action.SEND_MULTIPLE": 301,
    "android.nfc.action.NDEF_DISCOVERED": 302,
    "com.baidu.location.service_v2.2": 303,
    "com.lenovo.launcher.permission.READ_SETTINGS": 304,
    "android.accounts.AccountAuthenticator": 305,
    "android.intent.action.ACTION_VIEW_DOWNLOADS": 306,
    "android.media.browse.MediaBrowserService": 307,
    "android.net.ConnectivityManager.CONNECTIVITY_ACTION": 308,
    "android.webkit.permission.PLUGIN": 309,
    "com.anddoes.launcher.permission.READ_SETTINGS": 310,
    "com.tencent.android.tpush.action.INTERNAL_PUSH_MESSAGE": 311,
    "com.tencent.android.tpush.action.SDK": 312,
    "freemme.permission.msa": 313,
    "android.intent.action.GET_CONTENT": 314,
    "android.permission.READ_PRIVILEGED_PHONE_STATE": 315,
    "android.permission.RUN_INSTRUMENTATION": 316,
    "com.google.android.launcher.permission.READ_SETTINGS": 317,
    "com.launcher.smart.android.intent.action.APPLY_THEME": 318,
    "com.sec.android.app.twlauncher.settings.READ_SETTINGS": 319,
    "org.adw.launcher_donut.permission.READ_SETTINGS": 320,
    "cn.jpush.android.intent.ACTION_RICHPUSH_CALLBACK": 321,
    "com.android.mylauncher.permission.READ_SETTINGS": 322,
    "com.google.android.gms.permission.ACTIVITY_RECOGNITION": 323,
    "com.tencent.android.tpush.action.FEEDBACK": 324,
    "com.tencent.android.tpush.action.PUSH_MESSAGE": 325,
    "android.intent.action.PICK": 326,
    "android.permission.ACCOUNT_MANAGER": 327,
    "android.permission.INTERACT_ACROSS_USERS": 328,
    "android.permission.WRITE_INTERNAL_STORAGE": 329,
    "com.android.launcher3.permission.WRITE_SETTINGS": 330,
    "com.android.setting.permission.ALLSHARE_CAST_SERVICE": 331,
    "com.launcher.smart.android.permission.READ_THEME": 332,
    "com.launcher.smart.android.permission.RECEIVE_THEME_UPDATE": 333,
    "com.yandex.metrica.configuration.service.PLC": 334,
    "android.permission.USES_POLICY_FORCE_LOCK": 335,
    "cn.nubia.launcher.permission.READ_SETTINGS": 336,
    "com.ebproductions.android.launcher.permission.READ_SETTINGS": 337,
    "android.permission.DEVICE_POWER": 338,
    "android.permission.WRITE_APN_SETTINGS": 339,
    "com.mlive.id": 340,
    "COM_TAOBAO_TAE_SDK_TRADE_WEB_VIEW_ACTION": 341,
    "android.content.SyncAdapter": 342,
    "com.alibaba.intent.action.GETWAY": 343,
    "MainActivity.AlarmAction": 344,
    "andstartScreenroid.permission.READ_EXTERNAL_STORAGE": 345,
    "com.alibaba.push2.action.NOTIFICATION_OPENED": 346,
    "com.alibaba.push2.action.NOTIFICATION_REMOVED": 347,
    "com.alibaba.sdk.android.push.NOTIFY_ACTION": 348,
    "com.facebook.main": 349,
    "android.hardware.camera": 350,
    "android.intent.action": 351,
    "android.intent.action.MEDIA_SEARCH": 352,
    "com.alibaba.sdk.android.push.RECEIVE": 353,
    "cn.jpush.android.intent.NOTIFICATION_CLICK_ACTION": 354,
    "com.android.launcher2.permission.WRITE_SETTINGS": 355,
    "android.intent.category.OPENABLE": 356,
    "android.permission.DELETE_PACKAGES": 357,
    "android.intent.action.LOCALE_CHANGED": 358,
    "android.intent.action.SET_WALLPAPER": 359,
    "android.media.action.IMAGE_CAPTURE": 360,
    "android.permission.REQUEST_COMPANION_RUN_IN_BACKGROUND": 361,
    "android.permission.SET_ALARM": 362,
    "android.permission.WRITE_SECURE_SETTINGS": 363,
    "com.huawei.launcher3.permission.WRITE_SETTINGS": 364,
    "com.qihoo360.launcher.permission.WRITE_SETTINGS": 365,
    "com.taobao.hotfix.action": 366,
    "io.rong.push.intent.action.HEART_BEAT": 367,
    "android.intent.action.PACKAGE_INSTALL": 368,
    "android.permission.ACCESS_ASSISTED_GPS": 369,
    "android.permission.ANSWER_PHONE_CALLS": 370,
    "android.permission.MANAGE_DOCUMENTS": 371,
    "com.farsitel.bazaar.permission.PAY_THROUGH_BAZAAR": 372,
    "com.huawei.launcher2.permission.WRITE_SETTINGS": 373,
    "ir.mservices.market.BILLING": 374,
    "android.intent.apicloud.notification": 375,
    "android.nfc.action.TECH_DISCOVERED": 376,
    "android.permission.MANAGE_EXTERNAL_STORAGE": 377,
    "android.permission.READ_MEDIA_IMAGES": 378,
    "android.permission.READ_USER_DICTIONARY": 379,
    "android.permission.UPDATE_APP_OPS_STATS": 380,
    "android.permission.WRITE_USER_DICTIONARY": 381,
    "android.view.InputMethod": 382,
    "com.alibaba.sdk.android.push.CHECK_SERVICE": 383,
    "com.fede.launcher.permission.WRITE_SETTINGS": 384,
    "com.google.android.gms.appinvite.ACTION_PREVIEW": 385,
    "com.lge.launcher.permission.WRITE_SETTINGS": 386,
    "net.qihoo.launcher.permission.WRITE_SETTINGS": 387,
    "org.adw.launcher.permission.WRITE_SETTINGS": 388,
    "android.permission.BODY_SENSORS": 389,
    "android.permission.RECEIVE_WAP_PUSH": 390,
    "com.anddoes.launcher.permission.WRITE_SETTINGS": 391,
    "com.htc.launcher.permission.WRITE_SETTINGS": 392,
    "com.tencent.qqlauncher.permission.WRITE_SETTINGS": 393,
    "org.adwfreak.launcher.permission.WRITE_SETTINGS": 394,
    "android.intent.action.ACTION_PACKAGE_ADDED": 395,
    "android.permission.BIND_ACCESSIBILITY_SERVICE": 396,
    "android.permission.READ_INTERNAL_STORAGE": 397,
    "android.permission.SEND_DOWNLOAD_COMPLETED_INTENTS": 398,
    "com.meizu.flyme.launcher.permission.READ_SETTINGS": 399,
    "com.mob.open.app_20000": 400,
    "com.mob.open.app_lk": 401,
    "com.mob.service.action.MOB_AC_SERVICE": 402,
    "com.sec.android.app.twlauncher.settings.WRITE_SETTINGS": 403,
    "dcloud.push.broswer": 404,
    "android.intent.category.MULTIWINDOW_LAUNCHER": 405,
    "android.permission.BAIDU_LOCATION_SERVICE": 406,
    "com.google.zxing.client.android.SCAN": 407,
    "android.intent.action.SETTINGS": 408,
    "android.intent.category.default": 409,
    "android.permission.GET_INTENT_SENDER_INTENT": 410,
    "cn.jpush.android.intent.UNREGISTRATION": 411,
    "com.android.mylauncher.permission.WRITE_SETTINGS": 412,
    "com.android.permission.INSTALL_SHORTCUT": 413,
    "com.ebproductions.android.launcher.permission.WRITE_SETTINGS": 414,
    "com.getui.gtc.sdk.service.action": 415,
    "com.nd.android.launcher.permission.READ_SETTINGS": 416,
    "com.talkingdata.sdk.TDAntiCheatingService": 417,
    "org.adw.launcher_donut.permission.WRITE_SETTINGS": 418,
    "telecom.mdesk.permission.READ_SETTINGS": 419,
    "telecom.mdesk.permission.WRITE_SETTINGS": 420,
    "android.intent.action.PACKAGE_FULLY_REMOVED": 421,
    "android.permission.BIND_NOTIFICATION_LISTENER_SERVICE": 422,
    "android.permission.WRITE_OWNER_DATA": 423,
    "com.mx.launcher.permission.READ_SETTINGS": 424,
    "com.s.launcher.permission.READ_SETTINGS": 425,
    "com.teslacoilsw.launcher.permission.READ_SETTINGS": 426,
    "android.hardware.usb.action.USB_DEVICE_ATTACHED": 427,
    "android.permission.WRITE_PROFILE": 428,
    "com.amazon.device.messaging.intent.RECEIVE": 429,
    "com.amazon.device.messaging.intent.REGISTRATION": 430,
    "com.google.android.apps.googlevoice.permission.RECEIVE_SMS": 431,
    "com.google.android.apps.googlevoice.permission.SEND_SMS": 432,
    "com.ztemt.launcher.permission.READ_SETTINGS": 433,
    "io.rong.push.intent.MESSAGE_ARRIVED": 434,
    "io.rong.push.intent.MESSAGE_CLICKED": 435,
    "android.accessibilityservice.category.FEEDBACK_AUDIBLE": 436,
    "android.accessibilityservice.category.FEEDBACK_HAPTIC": 437,
    "android.accessibilityservice.category.FEEDBACK_SPOKEN": 438,
    "android.intent.action.ACTION_TIME_TICK": 439,
    "android.intent.action.MUSIC_PLAYER": 440,
    "android.permission.BIND_APPWIDGET": 441,
    "android.permission.MANAGE_OWN_CALLS": 442,
    "android.permission.READ_OWNER_DATA": 443,
    "android.permission.REQUEST_COMPANION_USE_DATA_IN_BACKGROUND": 444,
    "com.amazon.device.messaging.permission.RECEIVE": 445,
    "com.android.launcher.action.INSTALL_SHORTCUT": 446,
    "com.zte.mifavor.launcher.permission.READ_SETTINGS": 447,
    "info.guardianproject.panic.action.TRIGGER": 448,
    "android.permission.BLUETOOTH_PRIVILEGED": 449,
    "android.permission.PERSISTENT_ACTIVITY": 450,
    "android.permission.READ_MEDIA_AUDIO": 451,
    "com.mob.id.app_30000": 452,
    "com.mob.id.app_lk": 453,
    "com.mob.intent.MOB_ID_SERVICE": 454,
    "com.qihoo.life.plugin.streamapp.ACTION_PUSH_TO_PLUGIN": 455,
    "com.tsf.shell.permission.READ_SETTINGS": 456,
    "io.rong.imkit.intent.action.webview": 457,
    "android.intent.action.PACKAGE_RESTARTED": 458,
    "android.permission.CLEAR_APP_USER_DATA": 459,
    "android.permission.READ_MEDIA_VIDEO": 460,
    "android.permission.USE_SIP": 461,
    "com.actionlauncher.playstore.permission.READ_SETTINGS": 462,
    "com.apusapps.launcher.permission.READ_SETTINGS": 463,
    "com.bbk.launcher2.permission.WRITE_SETTINGS": 464,
    "com.google.android.gms.analytics.ANALYTICS_DISPATCH": 465,
    "dianxin.permission.ACCESS_LAUNCHER_DATA": 466,
    "io.rong.imkit.intent.action.openfile": 467,
    "io.rong.imkit.intent.action.picturepagerview": 468,
    "jpush.testAction": 469,
    "jpush.testCategory": 470,
    "android.Manifest.permission.READ_PHONE_STATE": 471,
    "android.app.action.DEVICE_ADMIN_DISABLE_REQUESTED": 472,
    "android.app.action.NEXT_ALARM_CLOCK_CHANGED": 473,
    "android.intent.action.QUICKBOOT_POWEROFF": 474,
    "android.permission.CAPTURE_AUDIO_OUTPUT": 475,
    "android.permission.WRITE_SOCIAL_STREAM": 476,
    "android.provider.Telephony.WAP_PUSH_RECEIVED": 477,
    "com.android.voicemail.permission.ADD_VOICEMAIL": 478,
    "com.google.android.gms.iid.InstanceID": 479,
    "com.meizu.flyme.permission.PUSH": 480,
    "com.meizu.flyme.push.intent.PUSH_SYSTEM": 481,
    "net.vrallev.android.job.v14.RUN_JOB": 482,
    "android.bluetooth.device.action.ACL_CONNECTED": 483,
    "android.bluetooth.device.action.ACL_DISCONNECTED": 484,
    "android.intent.action.INCOGNITO": 485,
    "android.intent.action.INSERT": 486,
    "android.intent.action.PROCESS_TEXT": 487,
    "android.intent.action.READING": 488,
    "android.intent.action.SIM_STATE_CHANGED": 489,
    "android.intent.category._HOME": 490,
    "android.permission.ACCESS_SUPERUSER": 491,
    "android.permission.READ_SOCIAL_STREAM": 492,
    "android.service.wallpaper.Wallpaper_X_Service": 493,
    "com.android.launcher2.permission.INSTALL_SHORTCUT": 494,
    "com.evernote.android.job.v14.RUN_JOB": 495,
    "com.firebase.jobdispatcher.ACTION_EXECUTE": 496,
    "com.google.android.apps.photos.permission.GOOGLE_PHOTOS": 497,
    "com.huawei.android.push.intent.REGISTER": 498,
    "com.huawei.authentication.HW_ACCESS_AUTH_SERVICE": 499,
    "com.lenovo.launcher.permission.WRITE_SETTINGS": 500,
    "com.qiku.launcher.permission.READ_SETTINGS": 501,
    ".MainReceiver.ACTION_SERVICE_RESTART": 502,
    ".MainReceiver.ACTION_SERVICE_STOP": 503,
    "android.intent.action.ANY_DATA_STATE": 504,
    "android.intent.action.EVENT_REMINDER": 505,
    "android.intent.action.INPUT_METHOD_CHANGED": 506,
    "android.permission.ACCESS_CACHE_FILESYSTEM": 507,
    "android.permission.ACCESS_WIMAX_STATE": 508,
    "android.permission.BIND_DIRECTORY_SEARCH": 509,
    "android.permission.BOOT_COMPLETED": 510,
    "android.permission.CHANGE_WIMAX_STATE": 511,
    "android.permission.GET_CLIPS": 512,
    "android.permission.MEDIA_CONTENT_CONTROL": 513,
    "android.permission.READ_CELL_BROADCASTS": 514,
    "android.permission.READ_CLIPS": 515,
    "android.permission.READ_INSTALL_SESSIONS": 516,
    "android.permission.REAL_GET_TASKS": 517,
    "android.permission.SET_TIME_ZONE": 518,
    "android.permission.SUBSCRIBED_FEEDS_READ": 519,
    "android.permission.SUBSCRIBED_FEEDS_WRITE": 520,
    "android.permission.UNKNOWN": 521,
    "android.permission.WRITE_CLIPS": 522,
    "com.android.launcher3.permission.INSTALL_SHORTCUT": 523,
    "com.android.voicemail.permission.READ_WRITE_ALL_VOICEMAIL": 524,
    "com.baidu.android.pushservice.action.METHOD": 525,
    "com.google.android.gms.permission.AD_ID_NOTIFICATION": 526,
    "com.google.android.googleapps.permission.GOOGLE_AUTH": 527,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.OTHER_SERVICES": 528,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.YouTubeUser": 529,
    "com.google.android.launcher.permission.WRITE_SETTINGS": 530,
    "com.google.android.providers.talk.permission.READ_ONLY": 531,
    "com.google.android.providers.talk.permission.WRITE_ONLY": 532,
    "com.samsung.android.scloud.backup.lib.read": 533,
    "com.samsung.android.scloud.backup.lib.write": 534,
    "com.samsung.svoice.sync.ACCESS_SERVICE": 535,
    "com.samsung.svoice.sync.READ_DATABASE": 536,
    "com.samsung.svoice.sync.WRITE_DATABASE": 537,
    "com.sec.android.app.voicenote.Controller": 538,
    "com.sec.android.permission.LAUNCH_PERSONAL_PAGE_SERVICE": 539,
    "com.sec.android.permission.VOIP_INTERFACE": 540,
    "com.sec.android.settings.permission.SOFT_RESET": 541,
    "com.yulong.android.launcher.permission.READ_SETTINGS": 542,
    "download.intent.action.DOWNLOAD_CANCEL": 543,
    "download.intent.action.DOWNLOAD_PAUSE": 544,
    "download.intent.action.DOWNLOAD_RESUME": 545,
    "io.rong.push.intent.MI_MESSAGE_ARRIVED": 546,
    "io.rong.push.intent.MI_MESSAGE_CLICKED": 547,
    "oppo.permission.OPPO_COMPONENT_SAFE": 548,
    "sec.android.permission.READ_MSG_PREF": 549,
    "action.restart.PERSISTENT_SERVICE": 550,
    "android.intent.action.ACTION_MEDIA_EJECT": 551,
    "android.intent.action.PACKAGE_DATA_CLEARED": 552,
    "android.intent.action.TIME_CHANGED": 553,
    "android.intent.action.oppopush": 554,
    "android.media.action.VIDEO_CAPTURE": 555,
    "android.permission.LOCATION_HARDWARE": 556,
    "android.permission.MOUNT_UNMOUNT_FILESYSTEM": 557,
    "android.permission.REQUEST_PASSWORD_COMPLEXITY": 558,
    "android.permission.UNINSTALL_SHORTCUT": 559,
    "android.provider.Telephony.SECRET_CODE": 560,
    "bt": 561,
    "com.google.zxing.client.android.ENCODE": 562,
    "com.hpplay.sdk.source.LelinkSdkService.ACTION": 563,
    "com.huawei.android.push.PLUGIN": 564,
    "com.huawei.android.push.intent.REFRESH_PUSH_CHANNEL": 565,
    "com.huawei.intent.action.PUSH_ON": 566,
    "com.keskin.music.PLAYBACK_VIEWER": 567,
    "com.samsung.android.providers.context.permission.READ_RECORD_AUDIO": 568,
    "com.samsung.android.providers.context.permission.WRITE_RECORD_AUDIO": 569,
    "com.spitchenko.appsgeyser": 570,
    "com.yulong.android.launcher3.READ_SETTINGS": 571,
    "com.yulong.android.launcherL.permission.READ_SETTINGS": 572,
    "android.intent.action.DIAL": 573,
    "android.permission.ACCESS_MEDIA_LOCATION": 574,
    "android.permission.GET_TOP_ACTIVITY_INFO": 575,
    "android.permission.REBOOT": 576,
    "android.permission.SET_TIME": 577,
    "android.permission.WRITE_EXTERNAL_STORAG": 578,
    "com.fingerprints.service.ACCESS_FINGERPRINT_MANAGER": 579,
    "com.gionee.amisystem.permission.READ_SHORTCUT": 580,
    "com.loonggg.alarm.clock": 581,
    "com.mintegral.msdk.download.action": 582,
    "com.sonyericsson.home.action.UPDATE_BADGE": 583,
    "com.xdandroid.hellodaemon.CANCEL_JOB_ALARM_SUB": 584,
    "com.xiaomi.permission.AUTH_SERVICE": 585,
    "io.rong.push.intent.THIRD_PARTY_PUSH_STATE": 586,
    "acr.browser.lightning": 587,
    "acr.browser.lightning.permission.C2D_MESSAGE": 588,
    "android.intent.action.MEDIA_BAD_REMOVAL": 589,
    "android.intent.category.MONKEY": 590,
    "android.media.action.STILL_IMAGE_CAMERA": 591,
    "android.nfc.cardemulation.action.HOST_APDU_SERVICE": 592,
    "android.permission.ACTIVITY_RECOGNITION": 593,
    "android.permission.LOCAL_MAC_ADDRESS": 594,
    "android.permission.MANAGE_USERS": 595,
    "android.permission.PREVENT_POWER_KEY": 596,
    "android.service.quicksettings.action.QS_TILE_PREFERENCES": 597,
    "android.telephony.action.CARRIER_CONFIG_CHANGED": 598,
    "com.android.launcher3.permission.UNINSTALL_SHORTCUT": 599,
    "com.baidu.android.pushservice.action.BIND_SYNC": 600,
    "com.dcloud": 601,
    "com.gau.go.launcherex.permission.READ_SETTINGS": 602,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.finance": 603,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.gbase": 604,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.groups2": 605,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.lh2": 606,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.local": 607,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.mail": 608,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.orkut": 609,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.sitemaps": 610,
    "com.google.zxing.client.android.SEARCH_BOOK_CONTENTS": 611,
    "com.google.zxing.client.android.SHARE": 612,
    "com.qihoo360.home.permission.READ_SETTINGS": 613,
    "io.rong.imkit.intent.action.gifrview": 614,
    "net.dinglisch.android.tasker.PERMISSION_RUN_TASKS": 615,
    "android.appwidget.action.APPWIDGET_DISABLED": 616,
    "android.appwidget.action.APPWIDGET_ENABLED": 617,
    "android.hardware.usb.action.USB_ACCESSORY_DETACHED": 618,
    "android.intent.action.ACTION_BATTERY_CHANGED": 619,
    "android.intent.action.APPLICATION_PREFERENCES": 620,
    "android.intent.action.DATA_SMS_RECEIVED": 621,
    "android.intent.action.MEDIA_SHARED": 622,
    "android.media.action.VIDEO_CAMERA": 623,
    "android.net.wifi.RSSI_CHANGED": 624,
    "android.permission.ACCESS_MTK_MMHW": 625,
    "android.permission.INJECT_EVENTS": 626,
    "android.speech.action.VOICE_SEARCH_RESULTS": 627,
    "cn.nubia.launcher.permission.WRITE_SETTINGS": 628,
    "com.android.launcher2.permission.UNINSTALL_SHORTCUT": 629,
    "com.baidu.android.pushservice.action.MESSAGE": 630,
    "com.baidu.android.pushservice.action.RECEIVE": 631,
    "com.gau.go.launcherex.permission.WRITE_SETTINGS": 632,
    "com.google.android.gcm.intent.RETRY": 633,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.adsense": 634,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.adwords": 635,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.ah": 636,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.blogger": 637,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.cl": 638,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.cp": 639,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.dodgeball": 640,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.grandcentral": 641,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.health": 642,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.ig": 643,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.jotspot": 644,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.knol": 645,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.mobile": 646,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.news": 647,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.notebook": 648,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.print": 649,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.speech": 650,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.speechpersonalization": 651,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.talk": 652,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.wifi": 653,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.wise": 654,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.writely": 655,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.youtube": 656,
    "com.heimavista.DefaultActivity": 657,
    "com.heimavista.magicsquarebasic.rabbitmq.intent.RECEIVE": 658,
    "com.heimavista.magicsquarebasic.service.hvApnService": 659,
    "com.m7.imkfsdk.KEFU_NEW_MSG": 660,
    "com.meizu.flyme.launcher.permission.WRITE_SETTINGS": 661,
    "com.pplive.sdk.service": 662,
    "com.qihoo360.home.permission.WRITE_SETTINGS": 663,
    "com.sec.android.app.twlauncher.READ_SETTINGS": 664,
    "FCM_PLUGIN_ACTIVITY": 665,
    "MediaStore.Images.Media.EXTERNAL_CONTENT_URI": 666,
    "NotificationListenerService": 667,
    "PACKAGE_NAME.permission.C2D_MESSAGE": 668,
    "android.app.action.APP_BLOCK_STATE_CHANGED": 669,
    "android.app.action.NOTIFICATION_CHANNEL_BLOCK_STATE_CHANGED": 670,
    "android.app.action.NOTIFICATION_CHANNEL_GROUP_BLOCK_STATE_CHANGED": 671,
    "android.intent.action.ACTION_USER_PRESENT": 672,
    "android.intent.action.APP_ERROR": 673,
    "android.intent.action.SIG_STR": 674,
    "android.intent.action.TIME_TICK": 675,
    "android.launcher.permission.INSTALL_SHORTCUT": 676,
    "android.media.action.IMAGE_CAPTURE_SECURE": 677,
    "android.media.action.STILL_IMAGE_CAMERA_SECURE": 678,
    "android.permission.ACCESS_NETWORK_CONDITIONS": 679,
    "android.permission.BIND_WALLPAPER": 680,
    "android.permission.CHANGE_COMPONENT_ENABLED_STATE": 681,
    "android.permission.DUMP": 682,
    "android.permission.UPDATE_DEVICE_STATS": 683,
    "android.webkit.resource.AUDIO_CAPTURE": 684,
    "android.webkit.resource.VIDEO_CAPTURE": 685,
    "cn.swiftpass.wxpay.permission.MMOAUTH_CALLBACK": 686,
    "com.app.free.studio.lockscreen.lock": 687,
    "com.baidu.android.pushservice.action.notification.CLICK": 688,
    "com.google.android.c2dm.intent.UNREGISTRATION": 689,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.android": 690,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.androidsecure": 691,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.sierra": 692,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.sierraqa": 693,
    "com.google.android.googleapps.permission.GOOGLE_AUTH.sierrasandbox": 694,
    "com.hpplay.sdk.source.mirrorcast.ScreenCastService.ACTION": 695,
    "com.nd.android.launcher.permission.WRITE_SETTINGS": 696,
    "com.sec.android.app.twlauncher.WRITE_SETTINGS": 697,
    "com.urbanairship.push.CHANNEL_UPDATED": 698,
    "com.urbanairship.push.DISMISSED": 699,
    "com.urbanairship.push.OPENED": 700,
    "com.urbanairship.push.RECEIVED": 701,
    "com.weeba.agent.permission.C2D_MESSAGE": 702,
    "com.xiaomi.permission.WAKE_LOCK": 703,
    "com.yandex.metrica.push.action.NOTIFICATION_ACTION": 704,
    "jobhandler": 705,
    "notification_clicked": 706,
    "org.kustom.provider.WIDGETS": 707,
    "MediaStore.Images.Media.INTERNAL_CONTENT_URI": 708,
    "android.app.action.ACTION_DEVICE_ADMIN_DISABLED": 709,
    "android.hardware.usb.action.USB_DEVICE_DETACHED": 710,
    "android.intent.action.AIRPLANE_MODE": 711,
    "android.intent.action.ASSIST": 712,
    "android.intent.action.PACKAGE_FIRST_LAUNCH": 713,
    "android.intent.category.VIEW": 714,
    "android.nfc.action.TAG_DISCOVERED": 715,
    "android.permission.IMAGE_CAPTURE": 716,
    "android.permission.INTERNAL_SYSTEM_WINDOW": 717,
    "android.permission.MOUNT_FORMAT_FILESYSTEMS": 718,
    "android.permission.READ_NETWORK_USAGE_HISTORY": 719,
    "android.permission.STORAGE": 720,
    "cn.swiftpass.wxpay.permission.MM_MESSAGE": 721,
    "com.baidu.android.pushservice.action.PUSH_SERVICE": 722,
    "com.baidu.android.pushservice.action.notification.SHOW": 723,
    "com.baidu.autoupdatesdk.ACTION_AS_DOWNLOAD_COMPLETE": 724,
    "com.baidu.autoupdatesdk.ACTION_DOWNLOAD_COMPLETE": 725,
    "com.baidu.autoupdatesdk.ACTION_NEW_AS": 726,
    "com.baidu.autoupdatesdk.ACTION_NEW_UPDATE": 727,
    "com.chinaums.pppay.quickpay.service.IUmsQuickPayService": 728,
    "com.chinaums.pppay.service.DownloadServiceAction": 729,
    "com.google.android.gms.permission.AD_ID": 730,
    "com.google.intent.category.DAYDREAM": 731,
    "com.google.vr.vrcore.ACTION_NONE": 732,
    "com.huaqin.launcherEx.permission.READ_SETTINGS": 733,
    "com.huaqin.launcherEx.permission.WRITE_SETTINGS": 734,
    "com.huawei.android.push.plugin.RESPONSE": 735,
    "com.miui.mihome2.permission.READ_SETTINGS": 736,
    "com.miui.mihome2.permission.WRITE_SETTINGS": 737,
    "com.mx.launcher.permission.WRITE_SETTINGS": 738,
    "com.s.launcher.permission.WRITE_SETTINGS": 739,
    "com.sec.android.app.launcher.permission.READ_SETTINGS": 740,
    "com.teslacoilsw.launcher.permission.WRITE_SETTINGS": 741,
    "com.touchtv.sihui": 742,
    "com.twofortyfouram.locale.intent.action.EDIT_SETTING": 743,
    "com.twofortyfouram.locale.intent.action.FIRE_SETTING": 744,
    "com.twofortyfouram.locale.intent.action.REQUEST_QUERY": 745,
    "com.ztemt.launcher.permission.WRITE_SETTINGS": 746,
    "net.dinglisch.android.taskerm.AWAKEY": 747,
    "net.dinglisch.android.taskerm.WILLYUM": 748,
    "notification_cancelled": 749,
    "org.adw.launcher.THEMES": 750,
    "org.adw.launcher.icons.ACTION_PICK_ICON": 751,
    "android.Net.wifi.WIFI_STATE_CHANGED": 752,
    "android.hardware.usb.accessory": 753,
    "android.hardware.usb.action.USB_STATE": 754,
    "android.hardware.usb.host": 755,
    "android.intent.action.ACTION_BATTERY_LOW": 756,
    "android.intent.action.ACTION_BATTERY_OKAY": 757,
    "android.intent.action.CLOSE_SYSTEM_DIALOGS": 758,
    "android.intent.action.MEDIA_SCANNER_FINISHED": 759,
    "android.intent.action.MEDIA_SCANNER_STARTED": 760,
    "android.intent.action.WALLPAPER_CHANGED": 761,
    "android.intent.category.ALTERNATIVE": 762,
    "android.intent.category.APP_MUSIC": 763,
    "android.intent.category.INFO": 764,
    "android.intent.category.PREFERENCE": 765,
    "android.media.action.ACTION_VIDEO_CAPTURE": 766,
    "android.net.wifi.WIFI_AP_STATE_CHANGED": 767,
    "android.permission.ACCESS_WEATHERCLOCK_PROVIDER": 768,
    "android.permission.BIND_JOB_SERVICE": 769,
    "android.permission.CAPTURE_SECURE_VIDEO_OUTPUT": 770,
    "android.permission.FLAG_GRANT_READ_URI_PERMISSION": 771,
    "android.permission.READ_FRAME_BUFFER": 772,
    "android.permission.STORAGE_INTERNAL": 773,
    "app.cobo.launcher.permission.READ_SETTINGS": 774,
    "app.cobo.launcher.permission.WRITE_SETTINGS": 775,
    "com.baidu.android.pushservice.action.media.CLICK": 776,
    "com.eusoft.eudic.action.SHARED_LOGIN": 777,
    "com.eusoft.eudic.category.LOGIN": 778,
    "com.hola.launcher.permission.READ_SETTINGS": 779,
    "com.hola.launcher.permission.WRITE_SETTINGS": 780,
    "com.htc.intent.action.PACKAGE_REPLACED": 781,
    "com.huawei.launcher.permission.READ_SETTINGS": 782,
    "com.huawei.launcher.permission.WRITE_SETTINGS": 783,
    "com.kf5.sdk.im.service.MessageService": 784,
    "com.mob.intent.MOB_SERVICE": 785,
    "com.smartisanos.launcher.READ_DATABASE": 786,
    "com.smartisanos.launcher.WRITE_DATABASE": 787,
    "com.taobao.taobao.intent.action.COMMAND": 788,
    "com.umeng.message.action.notify": 789,
    "com.yandex.metrica.configuration.ACTION_START": 790,
    "intent.action.requestInstallPermission": 791,
    "io.rong.imkit.intent.action.combinewebview": 792,
    "io.rong.imkit.intent.action.openwebfile": 793,
    "org.agoo.android.intent.action.PING_V4": 794,
    "org.kustom.provider.WALLPAPERS": 795,
    "startService": 796,
    "action_notification_cancel": 797,
    "action_notification_click": 798,
    "android.appwidget.action.APPWIDGET_DELETED": 799,
    "android.appwidget.action.APPWIDGET_HOST_RESTORED": 800,
    "android.content.action.DOCUMENTS_PROVIDER": 801,
    "android.content.pm.action.CONFIRM_PIN_APPWIDGET": 802,
    "android.content.pm.action.CONFIRM_PIN_SHORTCUT": 803,
    "android.intent.action.CONFIGURATION_CHANGED": 804,
    "android.intent.action.DEFUALT": 805,
    "android.intent.action.SEARCH_LONG_PRESS": 806,
    "android.intent.action.SENT_SMS_ACTION": 807,
    "android.intent.action.SHOW_APP_INFO": 808,
    "android.location.PROVIDERS_CHANGED": 809,
    "android.net.wifi.p2p.CONNECTION_STATE_CHANGE": 810,
    "android.permission.ACCESS_ALL_DOWNLOADS": 811,
    "android.permission.ACCES_MOCK_LOCATION": 812,
    "android.permission.DELETE_CACHE_FILES": 813,
    "android.permission.INTERCEPT_SMS": 814,
    "android.permission.NETWORK": 815,
    "android.permission.REQUEST_INSTALL_PACKAGE": 816,
    "android.permission.SET_ORIENTATION": 817,
    "android.permission.STOP_APP_SWITCHES": 818,
    "android.permission.WRITE_APN_STORAGE": 819,
    "android.service.chooser.ChooserTargetService": 820,
    "cn.jpush.android.intent.WakedReceiver": 821,
    "com.Dean.launcher.permission.READ_SETTINGS": 822,
    "com.Dean.launcher.permission.WRITE_SETTINGS": 823,
    "com.aliyun.homeshell.permission.READ_SETTINGS": 824,
    "com.aliyun.homeshell.permission.WRITE_SETTINGS": 825,
    "com.alphalp.launcher.permission.READ_SETTINGS": 826,
    "com.alphalp.launcher.permission.WRITE_SETTINGS": 827,
    "com.android.ContactWidget.permission.WRITE_SETTINGS": 828,
    "com.android.camera.action.CROP": 829,
    "com.android.lewalauncher.permission.READ_SETTINGS": 830,
    "com.android.lewalauncher.permission.WRITE_SETTINGS": 831,
    "com.android.providers.media.MediaProvider": 832,
    "com.android.sprdlauncher1.permission.READ_SETTINGS": 833,
    "com.android.sprdlauncher1.permission.WRITE_SETTINGS": 834,
    "com.android.sprdlauncher2.permission.READ_SETTINGS": 835,
    "com.android.sprdlauncher2.permission.WRITE_SETTINGS": 836,
    "com.android.tpwlauncher2.permission.READ_SETTINGS": 837,
    "com.android.tpwlauncher2.permission.WRITE_SETTINGS": 838,
    "com.android.vending.billing.IN_APP_NOTIFY": 839,
    "com.android.vending.billing.PURCHASE_STATE_CHANGED": 840,
    "com.android.vending.billing.RESPONSE_CODE": 841,
    "com.asus.launcher3.permission.READ_SETTINGS": 842,
    "com.asus.launcher3.permission.WRITE_SETTINGS": 843,
    "com.baoruan.launcher2.permission.READ_SETTINGS": 844,
    "com.baoruan.launcher2.permission.WRITE_SETTINGS": 845,
    "com.dlto.atom.launcher.permission.READ_SETTINGS": 846,
    "com.dlto.atom.launcher.permission.WRITE_SETTINGS": 847,
    "com.ensoft.recite.NOTIFY_LEARNING": 848,
    "com.epic.launcher.tw.permission.READ_SETTINGS": 849,
    "com.epic.launcher.tw.permission.WRITE_SETTINGS": 850,
    "com.eusoft.dict.intent.action.REFRESH_OLN_DICT": 851,
    "com.eusoft.recite.APP_OPEN": 852,
    "com.fineos.launcher.permission.READ_SETTINGS": 853,
    "com.fineos.launcher.permission.WRITE_SETTINGS": 854,
    "com.hpplay.source.service.close": 855,
    "com.huawei.hms.analytics.pps.event": 856,
    "com.iLoong.permission.READ_SETTINGS": 857,
    "com.iLoong.permission.WRITE_SETTINGS": 858,
    "com.ibingo.launcher.permission.READ_SETTINGS": 859,
    "com.ibingo.launcher.permission.WRITE_SETTINGS": 860,
    "com.intent.action.ACTION_STUB_PLUGIN": 861,
    "com.intent.category.PLUGIN_DEFAULT": 862,
    "com.jui.launcher3.permission.READ_SETTINGS": 863,
    "com.jui.launcher3.permission.WRITE_SETTINGS": 864,
    "com.konka.launcher2.permission.READ_SETTINGS": 865,
    "com.konka.launcher2.permission.WRITE_SETTINGS": 866,
    "com.l.launcher.permission.READ_SETTINGS": 867,
    "com.l.launcher.permission.WRITE_SETTINGS": 868,
    "com.lo.launcher.permission.READ_SETTINGS": 869,
    "com.lo.launcher.permission.WRITE_SETTINGS": 870,
    "com.lollipop.launcher.permission.READ_SETTINGS": 871,
    "com.lollipop.launcher.permission.WRITE_SETTINGS": 872,
    "com.mbridge.msdk.download.action": 873,
    "com.mgyun.permission.READ_SETTINGS": 874,
    "com.mgyun.permission.WRITE_SETTINGS": 875,
    "com.microsoft.launcher.permission.READ_SETTINGS": 876,
    "com.microsoft.launcher.permission.WRITE_SETTINGS": 877,
    "com.modaco.android.launchergb.permission.READ_SETTINGS": 878,
    "com.modaco.android.launchergb.permission.WRITE_SETTINGS": 879,
    "com.motorola.dlauncher.permission.READ_SETTINGS": 880,
    "com.mycheering.launcher.permission.READ_SETTINGS": 881,
    "com.mycheering.launcher.permission.WRITE_SETTINGS": 882,
    "com.nicelauncher.lolauncher.permission.READ_SETTINGS": 883,
    "com.nicelauncher.lolauncher.permission.WRITE_SETTINGS": 884,
    "com.phonegap.plugins.barcodescanner.ENCODE": 885,
    "com.rjjmc.newscratch": 886,
    "com.rjjmc.newscratch.permission.JPUSH_MESSAGE": 887,
    "com.sec.android.app.launcher.permission.WRITE_SETTINGS": 888,
    "com.shangxueba.tc5.multidevice_login": 889,
    "com.slim.slimlauncher.permission.READ_SETTINGS": 890,
    "com.slim.slimlauncher.permission.WRITE_SETTINGS": 891,
    "com.smartisanos.launcher.data.ExportDataProvider": 892,
    "com.ss.android.aliyun.message": 893,
    "com.ss.android.hw.message": 894,
    "com.ss.android.message": 895,
    "com.ss.android.message.action.PUSH_SERVICE": 896,
    "com.ss.android.mz.message": 897,
    "com.ss.android.newmedia.message.cache.action": 898,
    "com.ss.android.newmedia.message.notify.delete.action": 899,
    "com.ss.android.oppo.message": 900,
    "com.ss.android.redbadge.message": 901,
    "com.ss.android.umeng.message": 902,
    "com.ss.android.vivo.message": 903,
    "com.ss.android.xiaomi.message": 904,
    "com.wireless.security.open.framework.DLProxyActivity.VIEW": 905,
    "com.zte.lqsoft.launcher.permission.READ_SETTINGS": 906,
    "com.zte.lqsoft.launcher.permission.WRITE_SETTINGS": 907,
    "com.zte.mifavor.launcher.permission.WRITE_SETTINGS": 908,
    "com.zte.mobile.ZteLauncher3D.permission.READ_SETTINGS": 909,
    "com.zte.mobile.ZteLauncher3D.permission.WRITE_SETTINGS": 910,
    "com.zui.launcher.permission.READ_SETTINGS": 911,
    "com.zui.launcher.permission.WRITE_SETTINGS": 912,
    "miui.intent.category.SYSAPP_RECOMMEND": 913,
    "org.openudid.GETUDID": 914,
    "MosSplashActivityToTarget": 915,
    "PlayerActivity": 916,
    "TIMER_ACTION": 917,
    "action.com.billy.cc.connection": 918,
    "android.app.develop.action.DEVICE_DELEGATION": 919,
    "android.bluetooth.headset.profile.action.CONNECTION_STATE_CHANGED": 920,
    "android.content.pm.action.SESSION_COMMITTED": 921,
    "android.hardware.usb.action.USB_ACCESSORY_ATTACHED": 922,
    "android.intent.action.BATTERY_CHANGED_ACTION": 923,
    "android.intent.action.CREATE_DOCUMENT": 924,
    "android.intent.action.DELETE": 925,
    "android.intent.action.MANAGE_NETWORK_USAGE": 926,
    "android.intent.action.OPEN_DOCUMENT": 927,
    "android.intent.action.View": 928,
    "android.intent.category.NOTIFICATION_PREFERENCES": 929,
    "android.intent.category.SELECTED_ALTERNATIVE": 930,
    "android.media.RINGER_MODE_CHANGED": 931,
    "android.media.VOLUME_CHANGED_ACTION": 932,
    "android.permision.WRITE_SECURE_SETTINGS": 933,
    "android.permission.DISABLE_STATUS_BAR": 934,
    "android.permission.FORCE_STOP_PACKAGES": 935,
    "android.permission.GET_APP_OPS_STATS": 936,
    "android.permission.NETWORK_ACCESS": 937,
    "android.permission.NETWORK_PROVIDER": 938,
    "android.permission.OVERRIDE_WIFI_CONFIG": 939,
